Revit 2027 API
CableTraySettings.SizeSeparator Property
 The cable tray size separator string.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string SizeSeparator { get; set; }
Public Property SizeSeparator As String
	Get
	Set
public:
property String^ SizeSeparator {
	String^ get ();
	void set (String^ value);
}
member SizeSeparator : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
CableTraySettings Class
Autodesk.Revit.DB.Electrical Namespace